import code from "../../public/assets/images/code-example.png";
import Image from "next/image";

export const exampleData = [
  {
    id: 1,
    label: "Introduction",
    title: "Introduction",
    lesson: [
      {
        id: 1,
        path: "/examples/HTML/content/content-1",
        title: "តួរនាទីនៃ HTML នៅក្នុង Web development",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        path: "/examples/HTML/content/content-1",
        title: "Structure មូលដ្ឋានរបស់ HTML",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        path: "/examples/HTML/content/content-1",
        title: "HTML tags និង Elements",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
  {
    id: 2,
    label: "Document Structure និង Sematic Markup",
    title: "Document Structure និង Sematic Markup",
    lesson: [
      {
        id: 1,
        title: "ការប្រកាស់ Doctype HTML",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        title: "Head និង Body section នៃ HTML document",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        title: "ការប្រើ headings, paragraph, lists និង links",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 4,
        title: "Semantic HTML elements",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
  {
    id: 3,
    label: "ការប្រើ Text និង Formatting",
    title: "ការប្រើ Text និង Formatting",
    lesson: [
      {
        id: 1,
        title: "ការប្រកាស់ Doctype HTML",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        title: "Head និង Body section នៃ HTML document",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        title: "ការប្រើ headings, paragraph, lists និង links",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 4,
        title: "Semantic HTML elements",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
  {
    id: 4,
    label: "Images និង Multimedia",
    title: "Images និង Multimedia",
    lesson: [
      {
        id: 1,
        path: "/examples/HTML/content/content-1",
        title: "តួរនាទីនៃ HTML នៅក្នុង Web development",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        path: "/examples/HTML/content/content-1",
        title: "Structure មូលដ្ឋានរបស់ HTML",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        path: "/examples/HTML/content/content-1",
        title: "HTML tags និង Elements",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
  {
    id: 5,
    label: "ការប្រើ Tables",
    title: "ការប្រើ Tables",
    lesson: [
      {
        id: 1,
        path: "/examples/HTML/content/content-1",
        title: "តួរនាទីនៃ HTML នៅក្នុង Web development",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        path: "/examples/HTML/content/content-1",
        title: "Structure មូលដ្ឋានរបស់ HTML",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        path: "/examples/HTML/content/content-1",
        title: "HTML tags និង Elements",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
  {
    id: 6,
    label: "Form និងការបញ្ចូលរបស់អ្នកប្រើប្រាស់",
    title: "Form និងការបញ្ចូលរបស់អ្នកប្រើប្រាស់",
    lesson: [
      {
        id: 1,
        title: "ការប្រកាស់ Doctype HTML",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        title: "Head និង Body section នៃ HTML document",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        title: "ការប្រើ headings, paragraph, lists និង links",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 4,
        title: "Semantic HTML elements",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
  {
    id: 7,
    label: "ការប្រើ Link និង Navigation",
    title: "ការប្រើ Link និង Navigation",
    lesson: [
      {
        id: 1,
        title: "ការប្រកាស់ Doctype HTML",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        title: "Head និង Body section នៃ HTML document",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        title: "ការប្រើ headings, paragraph, lists និង links",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 4,
        title: "Semantic HTML elements",
        path: "/examples/HTML/content/content-1",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
  {
    id: 8,
    label: "HTML5 Sematic element និង APIs",
    title: "HTML5 Sematic element និង APIs",
    lesson: [
      {
        id: 1,
        path: "/examples/HTML/content/content-1",
        title: "តួរនាទីនៃ HTML នៅក្នុង Web development",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        path: "/examples/HTML/content/content-1",
        title: "Structure មូលដ្ឋានរបស់ HTML",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        path: "/examples/HTML/content/content-1",
        title: "HTML tags និង Elements",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
  {
    id: 9,
    label: "ការប្រើ HTML5 និង CSS3 រួមគ្នា",
    title: "ការប្រើ HTML5 និង CSS3 រួមគ្នា",
    lesson: [
      {
        id: 1,
        path: "/examples/HTML/content/content-1",
        title: "តួរនាទីនៃ HTML នៅក្នុង Web development",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 2,
        path: "/examples/HTML/content/content-1",
        title: "Structure មូលដ្ឋានរបស់ HTML",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
      {
        id: 3,
        path: "/examples/HTML/content/content-1",
        title: "HTML tags និង Elements",
        content: (
          <div className="w-full">
            <h3>Environment</h3>
            <p className="pt-7">
              JavaScript ភាគច្រើនដំណើរការនៅក្នុងកម្មវិធីរុករកតាមអ៊ីនធឺណិត
              ឬដោយប្រើកម្មវិធីបន្ទាត់ពាក្យបញ្ជា node.js ។ នៅក្នុងការ ណែនាំនេះ
              យើងនឹងប្រើប្រាស់ប្រអប់ខ្សាច់ដែលមានមូលដ្ឋានលើបណ្តាញដែលបានបង្កប់សម្រាប់ឧទាហរណ៍របស់យើង។
              ទោះ យ៉ាងណាក៏ដោយ ប្រសិនបើអ្នកចង់រៀបចំបរិស្ថាននៅលើកុំព្យូទ័ររបស់អ្នក
              ហើយប្រើកម្មវិធីនិពន្ធអត្ថបទ ឬដែលអ្នកចូលចិត្ត
              ខាងក្រោមនេះជាជម្រើសមួយចំនួន។
            </p>
            <p className="pt-3">
              មិនចាំបាច់រៀបចំបរិយាកាសក្នុងតំបន់សម្រាប់ការណែនាំនេះទេ
              ដូច្នេះសូមកុំភ្លេចទៅផ្នែកបន្ទាប់ ប្រភេទ។
            </p>
            <h5 className="pt-2">ឯកសារ HTML</h5>
            <p>
              វិធីសាមញ្ញបំផុតដើម្បីចាប់ផ្តើមជាមួយបរិស្ថានមូលដ្ឋានគឺដោយបង្កើតឯកសារ
              HTML នៅលើកុំព្យូទ័ររបស់អ្នក។ បង្កើតឯកសារ example.html
              នៅកន្លែងណាមួយនៅលើកុំព្យូទ័ររបស់អ្នក
              បើកវានៅក្នុងកម្មវិធីនិពន្ធកូដដែលអ្នកចូលចិត្តហើយបិទភ្ជាប់ក្នុង
              កូដខាងក្រោម៖
            </p>
            <Image
              src={code}
              alt="code example"
              className="pt-3"
              style={{ width: "100" }}
            />
          </div>
        ),
      },
    ],
  },
];
